# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix
# (двух матриц). Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы
# складываем с первым элементом первой строки второй матрицы и т.д.

class Matrix:
    def __init__(self, matr):
        self.matr = matr

    def __str__(self):
        return '\n'.join(['\t'.join([str(j) for j in el]) for el in self.matr])

    def __add__(self, other):
        result = []
        numbers = []
        for i in range(len(self.matr)):
            for j in range(len(self.matr[0])):
                summa = other.matr[i][j] + self.matr[i][j]
                numbers.append(summa)
                if len(numbers) == len(self.matr):
                    result.append(numbers)
                    numbers = []
        return Matrix(result)


m_1 = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
m_2 = [[10, 11, 12], [13, 14, 15], [16, 17, 18]]

mat_1 = Matrix(m_1)
mat_2 = Matrix(m_2)
print('Исходные матрицы')
print(mat_1)
print('')
print(mat_2)
print('Результирующая матрица')
print(mat_1 + mat_2)
